[
    {
        "id": 1,
        "message": "The dragon turns around and gives you a burning look.",
        "choices": [
            "You call out to it, trying to calm it down.",
            "You stand your ground, ready to face it head-on.",
            "You turn around screaming like a mandrake."
        ],
        "outcomes": [
            {
                "message": "The dragon is upset by your attempt to communicate and lashes out.",
                "dragon_attack_increase": 10,
                "player_attack_increase": 5,
                "PE_use": 5,
                "Attribute_use": ["Ambition", 2]
                
            },
            {
                "message": "The dragon respects your bravery and prepares to fight you fairly. He swipes at you and scratches you, but without causing too much damage.",
                "dragon_attack_increase": 0,
                "player_attack_increase": 10,
                "PE_use": 0,
                "Attribute_use": ["Courage", 2]
            },
            {
                "message": "The dragon is confused by your reaction and hesitates.",
                "dragon_attack_increase": -5,
                "player_attack_increase": 0,
                "PE_use": 3,
                "Attribute_use": ["Intelligence", 2]
                
            }
        ]

    },
    {
        "id": 2,
        "message": "The dragon prepares to breathe fire at you.",
        "choices": [
            "You cast the Protego spell while attempting to shield yourself.",
            "You dodge behind a nearby rock, trying to avoid the flames.",
            "You cast a spell trying to extinguish the flames."
        ],
        "outcomes": [
            {
                "message": "- \"Protego!\" you shout, raising your wand just in time to partially block the dragon's fiery breath.",
                "dragon_attack_increase": 2,
                "player_attack_increase": 5,
                "PE_use": 2,
                "Attribute_use": ["Intelligence", 1]
            },
            {
                "message": "You narrowly avoid the flames, but the heat singes your clothes and skin.",
                "dragon_attack_increase": 7,
                "player_attack_increase": 0,
                "PE_use": 1,
                "Attribute_use": ["None", 0]
            },
            {
                "message": "- \"Aguamenti!\" you shout, successfully dousing the dragon's flames with a powerful jet of water.",
                "dragon_attack_increase": -10,
                "player_attack_increase": 10,
                "PE_use": 7,
                "Attribute_use": ["Intelligence", 2]
            }
        ]
    },

    {
        "id": 3,
        "message": "The dragon is momentarily stunned from your last move.",
        "choices": [
            "You seize the opportunity to launch a powerful attack.",
            "You take a moment to catch your breath and assess the situation.",
            "You summon a wild Pikkachu to distract the dragon."
        ],
        "outcomes": [
            {
                "message": "You channel all your energy into a single, devastating spell that hits the dragon squarely.",
                "dragon_attack_increase": 0,
                "player_attack_increase": 15,
                "PE_use": 10,
                "Attribute_use": ["Ambition", 2]
            },
            {
                "message": "You take a deep breath, steadying yourself for the next phase of the battle.",
                "dragon_attack_increase": 0,
                "player_attack_increase": 0,
                "PE_use": -15,
                "Attribute_use": ["None", 0]
            },
            {
                "message": "The Pikkachu appears out of nowhere, causing the dragon to turn its attention away from you. The dragon raises its right paw and crushes Pikachu like a mere fly. But you've gained the time you needed and cast Incendio directly at the creature's rear end!",
                "dragon_attack_increase": -15,
                "player_attack_increase": 0,
                "PE_use": 5,
                "Attribute_use": ["None", 0]
            }
        ]
    },

    {
        "id": 4,
        "message": "The dragon rises into the air, moving its huge wings in an impressive manner.",
        "choices": [
            "You aim a spell at the dragon's wings to try and bring it down.",
            "You prepare to defend yourself from an aerial attack.",
            "You summon a flock of enchanted birds to harass the dragon."
        ],
        "outcomes": [
            {
                "message": "- \"Confringo!\" Your spell hits the dragon's wing, causing it to lose balance.",
                "dragon_attack_increase": -2,
                "player_attack_increase": 5,
                "PE_use": 8,
                "Attribute_use": ["Intelligence", 2]
            },
            {
                "message": "You brace yourself as the dragon swoops down, narrowly avoiding its claws and teeth.",
                "dragon_attack_increase": 5,
                "player_attack_increase": 0,
                "PE_use": 3,
                "Attribute_use": ["None", 0]
            },
            {
                "message": "The enchanted birds swarm around the dragon, distracting it and causing it to lose focus.",
                "dragon_attack_increase": -5,
                "player_attack_increase": 5,
                "PE_use": 6,
                "Attribute_use": ["Loyalty", 2]
            }
        ]
    },

    {
        "id": 5,
        "message": "The Hungarian Horntail soars high into the air but is suddenly stopped by the chain holding it back. Enraged, it lunges at you.",
        "choices": [
            "You pull out a piece of meat and try to throw it into the crowd to distract the monster.",
            "You cast “Bombarda” on the dragon's snout.",
            "You call your Nimbus 2000."
        ],
        "outcomes": [
            {
                "message": "You throw the meat with all your strength, and the dragon turns its head to snatch it, giving you a chance to strike. But there's the crowd! The dragon accidentally eat one or two spectators. Oops. Severus Snape PAS CONTENT and immediately casts a spell on you: \"Crucio!\" You feel a sharp pain in your back.",
                "dragon_attack_increase": -5,
                "player_attack_increase": 2,
                "PE_use": 25,
                "Attribute_use": ["Ambition", 2]
            },
            {
                "message": "- \"Bombarda!\" you shout, and the spell hits the dragon's snout, causing it to reel back in pain.",
                "dragon_attack_increase": 0,
                "player_attack_increase": 15,
                "PE_use": 7,
                "Attribute_use": ["Courage", 2]
            },

            {
                "message": "You summon your magic broomstick, and with a swift maneuver, you manage to get close enough to the dragon to strike it.",
                "dragon_attack_increase": -10,
                "player_attack_increase": 15,
                "PE_use": 10,
                "Attribute_use": ["Loyalty", 2]
            }
        ]
    },
    {
        "id": 6,
        "message": "The dragon performs a triple backflip followed by a 360 and prepares to strike with its tail.",
        "choices": [
            "You cast “Stupefy” to try and stun the dragon.",
            "You roll to the side to avoid the tail strike.",
            "You cast “Rictusempra” to make the dragon laugh."
        ],
        "outcomes": [
            {
                "message": "- \"Stupefy!\" Your spell hits the dragon, but it only throws it off balance for a few seconds, and its attack is no less violent.",
                "dragon_attack_increase": 5,
                "player_attack_increase": -4,
                "PE_use": 4,
                "Attribute_use": ["Courage", 2]
            },
            {
                "message": "You roll to the side just in time, avoiding the dragon's tail strike.",
                "dragon_attack_increase": 5,
                "player_attack_increase": 3,
                "PE_use": 3,
                "Attribute_use": ["None", 0]
            },
            {
                "message": "- \"Rictusempra!\" The dragon starts laughing uncontrollably at your spell, giving you an opening.",
                "dragon_attack_increase": -5,
                "player_attack_increase": 15,
                "PE_use": 7,
                "Attribute_use": ["Intelligence", 2]
            }
        ]
    },

    {
        "id": 7,
        "message": "The dragon circles around you at full speed, spewing jets of flame.",
        "choices": [
            "You shoot a jet of flames with your wand, trying to counter the dragon's flames.",
            "You use your wand to create a whirlwind to divert the flames.",
            "You try to cut through the flames."
        ],
        "outcomes": [
            {
                "message": "- \"Incendio!\" you shout, and your flames collide with the dragon's, creating a spectacular fire explosion.",
                "dragon_attack_increase": 0,
                "player_attack_increase": 5,
                "PE_use": 6,
                "Attribute_use": ["Ambition", 2]
            },
            {
                "message": "- \"Ventus!\" You create a whirlwind that diverts the dragon's flames away from you but starts a fire in the crowd. Oops.",
                "dragon_attack_increase": -5,
                "player_attack_increase": 5,
                "PE_use": 8,
                "Attribute_use": ["Loyalty", 2]
            },

            {
                "message": "You manage to cut through the flames, but the heat is intense and drains your energy. Your spell only grazes the dragon.",
                "dragon_attack_increase": 5,
                "player_attack_increase": 0,
                "PE_use": 5,
                "Attribute_use": ["None", 0]
            }
        ]
    }

]